#Павлов Арсений, задача 39
a = input('введите название месяца:')
if a == 'январь': 
    print('31 день')
elif a == 'февраль':
    print('28 или 29 дней')
elif a == 'март':
    print('31 день')
elif a == 'апрель':
    print('30 дней')
elif a == 'май':
    print('31 день')
elif a == 'июнь':
    print('30 дней')
elif a == 'июль':
    print('31 день')
elif a == 'август':
    print('31 день')
elif a == 'сентябрь':
    print('30 дней')
elif a == 'октябрь':
    print('31 день')
elif a == 'ноябрь':
    print('30 дней')
elif a == 'декабрь':
    print('31 день')