#Павлов Арсений, задача 56
a = int(input('введите частоту волны:'))
if a < 3*(10**9):
    print('радиоволна')
elif 3*(10**9) <= a < 3*(10**12):
    print('микроволна') 
elif 3*(10**12) <= a < 4.3*(10**14): 
    print('инфракрасное излучение') 
elif 4.3*(10**14) <= a < 7.5*(10**14):
    print('видимое излучение') 
elif 7.5*(10**14) <= a < 3*(10**17):
    print('ультрафиолетовое излучение')
elif 3*(10**17) <= a < 3*(10**19): 
    print('рентгеновское излучение')
else:
    print('гамма-излучение')
